IDEA Open Model
ResultBase Class
Compatible with IDEA StatiCa 20.1
 Result base abstract class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultBase
 IdeaRS.OpenModel.Result.ResultOfNLA
 IdeaRS.OpenModel.Result.ResultOnSection
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class ResultBase
Public MustInherit Class ResultBase
The ResultBase type exposes the following members.
Constructors
Name | Description
ResultBase
Initializes a new instance of the ResultBase class
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace